

&НаКлиенте
Процедура ПараметрыПодключенияПриАктивизацииСтроки(Элемент)
	
	МассивСтрок = Элемент.ВыделенныеСтроки;
	СтрокаПараметрыПодключения = ПараметрыПодключенияПриАктивизацииСтрокиНаСервере(МассивСтрок);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПодключенияПриАктивизацииСтрокиНаСервере(Знач Строки)
	
	СтрокаПараметрыПодключения = "Параметры: "+Символы.ПС;
	Для Каждого Номер из Строки Цикл
		
		ТекущаяСтрока = Объект.ПараметрыПодключения[Номер];
		СтрокаПараметрыПодключения = СтрокаПараметрыПодключения + ТекущаяСтрока.Профиль + Символы.ПС;
		
	КонецЦикла;

	Возврат СтрокаПараметрыПодключения;

КонецФункции
